packages/xendit/__fixtures__/webhook_payload.json

{
  "id": "671fb45f-4029-4d69-8086-508b98217730",
  "external_id": "ORDER-101",
  "user_id": "628c68a356247c4e5178659d",
  "is_high": false,
  "payment_method": "BANK_TRANSFER",
  "status": "PAID",
  "merchant_name": "IndoPay Demo",
  "amount": 10000,
  "paid_amount": 10000,
  "bank_code": "MANDIRI",
  "paid_at": "2023-10-25T12:05:00.000Z",
  "payer_email": "jules@indopay.com",
  "description": "Payment for ORDER-101",
  "adjusted_received_amount": 10000,
  "fees_paid_amount": 0,
  "updated": "2023-10-25T12:05:00.000Z",
  "created": "2023-10-25T12:00:00.000Z",
  "currency": "IDR",
  "payment_channel": "MANDIRI",
  "payment_destination": "1234567890"
}
